---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveTopLevel
source: html/6905d47b-6107-d38f-ecf5-da89438ed5c4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveTopLevel Property

"Top Level"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveTopLevel { get; }
```